quotes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Selected Quotes and Links</title>
<!-- 2017-07-21 Fri 07:52 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="yury" />
<link rel="stylesheet" type="text/css" href="style.css">
</head>
<body>
<div id="content">
<h1 class="title">Selected Quotes and Links</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Open Source</a></li>
<li><a href="#sec-2">2. Emacs</a></li>
<li><a href="#sec-3">3. Made by Human, Made by Heaven</a></li>
<li><a href="#sec-4">4. Reliable Links (to Nordic Summit)</a></li>
<li><a href="#sec-5">5. Links</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Open Source</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>Программирование</b> - управление сложностью/Programming is a complexity management
("The Art of Unix Programming", Eric Raymond)
</p>

<p>
&#x2026;the value of higher level documentation, like specification of interfaces and descriptions of architecture, can be greater than the source code itself.
&#x2026;
Complexity and size effectively close source code for system programming projects like OSes compilers after, say, 
100K lines of code without good higher level documentation or participation in the project from its early stages. 
This "binarization" of source code in large system programming projects may mean that 
there is little strategic importance to keep the source code of system programs closed after it reaches a certain level of maturity,
with corresponding size and the level of complexity.
&#x2026;ценность документации более высокого уровня, такой, как спецификации интерфейсов и описание архитектуры, может превышать ценность самого исходного текста.
&#x2026;
Сложность и объем фактически "закрывают" исходные тексты системных
проектов, вроде ОС и компиляторов после превышения ими объема, скажем,
в 100 тысяч строк, при условии, что отсутствует документация высокого
уровня, и Вы не принимали личного участия в проекте с его ранних
стадий. Такая "бинаризация" исходных текстов в крупных системных
проектах может означать, что стратегическая важность сохранения
исходных текстов закрытыми может теряться после того, как проект
достигает некоторого уровня зрелости, а также соответствующего этой
стадии разработки размера и уровня сложности.
(A Second look at the Cathedral and the Bazaar by Nikolai Bezroukov)
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Emacs</h2>
<div class="outline-text-2" id="text-2">
<p>
<b>Emacs</b> allows you to do much more than just editing. Emacs is not a mere
editor like others, either in terminal or in GUI. Emacs is a development
platform. Emacs is beyond an editor. Emacs is a programming platform that has an
editor. Don't confuse Emacs with other real editors, which can only be
used for editing. (tuhdo.github.io)
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Made by Human, Made by Heaven</h2>
<div class="outline-text-2" id="text-3">
<p>
I think, there are two different types of professional work.
The first one is based on information which was made by humans.
We are using howto's, guides, source code, when we write a program, construct, audit etc.
The second one is based on information which was made by heaven.
It means, that we produce new knowledge and we need to 
retrieve information from nature, represent and analyse it;
and then it becomes input to the first type of work. 
It could be research in physics, mathematics, economics 
(which depends on social behavior and probability).    
Of course, these are poles apart and we have a mix of them in reality,
but with a different proportion and significance.
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Reliable Links (to Nordic Summit)</h2>
<div class="outline-text-2" id="text-4">
<p>
Millions of links appear every day in the Web and millions of links become broken, 
leading to different query errors (e.g. widespread 404-error). 
This reflects the dynamic character of the Web, but it becomes a difficulty when we wish to keep the content spread over the Web together.
The reliability of links plays an important role in software.
The present article is devoted to the static content. <a href="https:/frab.fscons.org/system/attachments/44/original/reliable_links.pdf?1471958172">link</a>
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Links</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>"Everything you need to start using GnuPG", Justin R. Miller <a href="files/mutt-gnupg-howto.pdf">pdf</a>
</li>

<li>"Attending an academic conference", Michael Ernst, Washington University <a href="files/conference-attendance.pdf">pdf</a>
</li>

<li>"Responding to non-native speakers of English", Sheryl Hort, University of Minnesota <a href="files/non-native.pdf">pdf</a>
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: yury</p>
<p class="date">Created: 2017-07-21 Fri 07:52</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
